Repository: Global19-atlassian-net/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es, ja, pt_br

source: Introduction
es: Introduccion
ja: イントロダクション
pt_br: Introdução

source: This is the documentation for the Sphinx documentation builder. Sphinx is a tool that translates a set of reStructuredText_ source files into various output formats, automatically producing cross-references, indices etc. That is, if you have a directory containing a bunch of reST-formatted documents (and possibly subdirectories of docs in there as well), Sphinx can generate a nicely-organized arrangement of HTML files (in some other directory) for easy browsing and navigation. But from the same source, it can also generate a LaTeX file that you can compile into a PDF version of the documents, or a PDF file directly using `rst2pdf <http://rst2pdf.googlecode.com>`_.
es: Esta es la documentación para el generador de documentación de Sphinx. Sphinx es una herramienta que traduce un conjunto de archivos de código fuente de reStructuredText_ en varios formatos de salida, produciendo automáticamente las referencias cruzadas, índices etc. Es decir, si usted tiene un directorio que contiene un montón de documentos con formato Rest (y posiblemente subdirectorios de documentación en allí tambien), Sphinx puede generar un arreglo muy bien organizado de archivos HTML (en algún otro directorio) para fácil navegación. Pero de la misma fuente, también puede generar un fichero LaTeX que se puede compilar en una versión PDF de los documentos, o un PDF archivo directamente usando `rst2pdf <http://rst2pdf.googlecode.com>`_.
ja: これはSphinxドキュメンテーションビルダーのドキュメントです。Sphinxは一連の reStructuredText_ (以下reST)のソースファイルを様々な出力形式に変換したり、クロスリファレンスやインデックスなどを自動生成するツールです。これは、もしreSTフォーマットのドキュメント群が含まれるディレクトリがあったとしたら、Sphinxはそこから非常によくまとまった配置のHTMLファイル群を生成することができるということを意味しています。サブディレクトリにソースが分かれていても問題はありません。また、結果のHTMLはブラウザで簡単に見たり、ナビゲーションもしっかりしたものになります。それだけではなく、同じソースファイルから、同様にLaTeXファイルも出力することができ、これをコンパイルすることでPDFバージョンのドキュメントも生成することができますし、 `rst2pdf <http://rst2pdf.googlecode.com>`_ を使用すると、直接PDFファイルを生成することもできます。
pt_br: Informações sobre o construtor de documentação Sphinx. Sphinx é uma ferramenta que traduz um conjunto de arquivos fonte reStructuredTex_ em vários formatos de saída, automaticamente produzindo referências cruzadas, índices etc. Quando temos um diretório contendo documentos reST-formatados (possivelmente subdiretórios de documentos também são contemplados), Sphinx pode gerar coleções de arquivos HTML (em algum outro diretório) para fácil leitura e navegação. Com base nessa mesma fonte de documentos reST também podem ser gerados arquivos LaTeX os quais podem ser transformados em documentos no formato PDF ou diretamente usando `rst2pdf <http://rst2pdf.googlecode.com>`_.

source: The focus is on hand-written documentation, rather than auto-generated API docs. Though there is support for that kind of docs as well (which is intended to be freely mixed with hand-written content), if you need pure API docs have a look at `Epydoc <http://epydoc.sf.net/>`_, which also understands reST.
es: La atención se centra en la documentación escrita a mano, en lugar de documentación de la API generadas automáticamente. Aunque existe apoyo para ese tipo de documentos, así (que está destinada a ser mezclados libremente con el contenido escrito a mano), si usted necesita documentación de la API pura echar un vistazo a `Epydoc <http://epydoc.sf.net/>`_, que también entiende reST.
ja: このドキュメントでは、自動生成のAPIのドキュメントではなく、手で作成するドキュメンテーションにフォーカスします。そのようなドキュメントのサポートに関してはまだ限定的にはあります(手で作成するコンテンツも自由に追加できるようにする予定)が、もし純粋なAPIドキュメントが必要であれば、 `Epydoc <http://epydoc.sf.net/>`_ をご覧ください。こちらもreSTを解釈することができます。
pt_br: O foco é na documentação escrita manualmente, em vez de API para documentação gerada automaticamente. Através do suporte a esses tipos de documentos (que podem ser livremente misturados com conteúdo manualmente produzido), pode ser usada documentação puramente de API dar uma olhada em `Epydoc <http://epydoc.sf.net/>`_, que também entende documentação reST

source: For a great "introduction" to writing docs in general -- the whys and hows, see also `Write the docs <http://write-the-docs.readthedocs.org/>`_, written by Eric Holscher.
es: Para una gran "introducción" a escribir documentos en general -- los porqués y los cómos, vea también `Write the docs <http://write-the-docs.readthedocs.org/>`_, escrito por Eric Holscher.
ja: ドキュメント執筆に関する一般的な「イントロダクション」、すなわち、「なにを」「どのように」書くのかについては、Eric Holscherが書いた `Write the docs <http://write-the-docs.readthedocs.org/>`_ も参照してください。
pt_br: Para uma ampla "introduction" a escrevendo documentação em geral -- os porquês e como se faz, ver também `Write the docs <http://write-the-docs.readthedocs.org/>`_, escrito por Eric Holscher.

source: Conversion from other systems
es: Conversión desde otros sistemas
ja: 他のシステムからの変換
pt_br: Conversão de outros sistemas

source: This section is intended to collect helpful hints for those wanting to migrate to reStructuredText/Sphinx from other documentation systems.
es: Esta sección está pensada para recoger consejos útiles para aquellos que quieran migrar a reStructuredText/Sphinx de otros sistemas de documentación.
ja: このセクションでは、他のドキュメントシステムからreStructuredText/Sphinxへの移行を考えている人達へのヒントを集めています。
pt_br: Essa seção contém dicas úteis para aqueles que desejam migrar para reStructuredText/Sphinx a partir de outros sistemas de documentação.

source: Gerard Flanagan has written a script to convert pure HTML to reST; it can be found at the `Python Package Index <https://pypi.python.org/pypi/html2rest>`_.
es: Gerard Flanagan ha escrito un script para convertir HTML puro a reST; que se puede encontrar en el `Python Package Index <https://pypi.python.org/pypi/html2rest>`_.
ja: Gerard FlanaganはHTMLからreSTに変換するスクリプトを作成しました。スクリプトは `Python Package Index <https://pypi.python.org/pypi/html2rest>`_ にあります。
pt_br: Gerard Flanagan escreveu um script para converter HTML puro para reST; pode ser encontrado em `Python Package Index <https://pypi.python.org/pypi/html2rest>`_.

source: For converting the old Python docs to Sphinx, a converter was written which can be found at `the Python SVN repository <http://svn.python.org/projects/doctools/converter>`_. It contains generic code to convert Python-doc-style LaTeX markup to Sphinx reST.
es: Para la conversión de los antiguos documentos de Python a Sphinx, un convertidor fue escrito, que se puede encontrar en `el repositorio SVN Python <http://svn.python.org/projects/doctools/converter>`_. Contiene código genérico para convertir formato LaTeX estilo Python-doc a Sphinx reST.
ja: 古いPythonのドキュメントをSphinxにコンバートするには、専用のコンバート用のツールを `PythonのSVNリポジトリ <http://svn.python.org/projects/doctools/converter>`_ で見つけることができます。これを使えば、Python-docスタイルのLaTeXのマークアップをSphinx reSTに変換できます。
pt_br: Para converter documentos do antigo Python, um conversor pode ser encontrado em `the Python SVN repository <http://svn.python.org/projects/doctools/converter>`_. Contém código genérico para converter marcação LaTeX doc-estilo-Python em reST Sphinx.

source: Marcin Wojdyr has written a script to convert Docbook to reST with Sphinx markup; it is at `Google Code <http://code.google.com/p/db2rst/>`_.
es: Marcin Wojdyr ha escrito un script para convertir Docbook a reST con el marcado de Sphinx; este esta en `Google Code <http://code.google.com/p/db2rst/>`_.
ja: Marcin WojdyrはDocbookをreST＋Sphinxマークアップに変換するスクリプトを作成しました。 `Google Code <http://code.google.com/p/db2rst/>`_ にあります。
pt_br: Marcin Wojdyr escreveu um script para converter Docbook em reST com marcação Sphinx código fonte está em `Google Code <http://code.google.com/p/db2rst/>`_.

source: Christophe de Vienne wrote a tool to convert from Open/LibreOffice documents to Sphinx: `odt2sphinx <https://pypi.python.org/pypi/odt2sphinx/>`_.
es: Christophe de Vienne escribió una herramienta para convertir desde documentos de Open/LibreOffice a Sphinx: `odt2sphinx <https://pypi.python.org/pypi/odt2sphinx/>`_.
ja: Christophe de VienneはOpen/LibreOfficeの文章をSphinxに変換するツール `odt2sphinx <https://pypi.python.org/pypi/odt2sphinx/>`_ を作成しました。
pt_br: Christophe de Vienne escreveu uma ferramente para converter documentos Open/LibreOffice para Sphinx: `odt2sphinx <https://pypi.python.org/pypi/odt2sphinx/>`_.

source: To convert different markups, `Pandoc <http://johnmacfarlane.net/pandoc/>`_ is a very helpful tool.
es: Para convertir diferentes marcas, `Pandoc <http://johnmacfarlane.net/pandoc/>`_ es una herramienta muy útil.
ja: 違うマークアップに変換するには、 `Pandoc <http://johnmacfarlane.net/pandoc/>`_ が非常に役に立つツールです。
pt_br: Para converter diferentes marcações, usar a ferramenta `Pandoc <http://johnmacfarlane.net/pandoc/>`_ , que ajuda muito.

source: Use with other systems
es: Usar con otros sistemas
ja: 他のシステムと併用
pt_br: Uso com outros sistemas

source: See the :ref:`pertinent section in the FAQ list <usingwith>`.
es: Ver la :ref:`seccion pertinente en la lista de FAQ <usingwith>`.
ja: :ref:`FAQの中の関連のリスト <usingwith>` を参照してください。
pt_br: Ver :ref: `seção pertinente na lista FAQ <usingwith>`.

source: Prerequisites
es: Requisitos previos
ja: 前提条件
pt_br: Pré-requisitos

source: Sphinx needs at least **Python 2.5** or **Python 3.1** to run, as well as the docutils_ and Jinja2_ libraries. Sphinx should work with docutils version 0.7 or some (not broken) SVN trunk snapshot. If you like to have source code highlighting support, you must also install the Pygments_ library.
ja: Sphinxおよび、 docutils_ 、 Jinja2_ などのライブラリの実行には **Python 2.5** か **Python 3.1** 以上が必要です。Sphinxが依存しているコンポーネントとしては、docutilsのバージョン 0.7、もしくはSVNリポジトリのTrunkのスナップショット(壊れていないものに限定)があります。もしもソースコードハイライトのサポートが必要であれば、 Pygments_ ライブラリも一緒にインストールする必要があります。

source: Usage
es: Uso
ja: 使用方法
pt_br: Uso

source: See :doc:`tutorial` for an introduction. It also contains links to more advanced sections in this manual for the topics it discusses.
es: Ver: doc:`tutorial` para una introducción. También contiene enlaces a secciones más avanzadas de este manual para los temas que aborda.
ja: 導入の説明にあたっては、 :doc:`tutorial` を参照してください。このドキュメントには、説明しているそれぞれの内容に対して、発展的な内容を説明しているセクションへのリンクが含まれています。
pt_br: Ver :doc:`tutorial` para uma introdução. Também contém links para seções mais avançadas nesse manual, para detalhamento dos tópicos.
